app/views/columns/_form.html.erb

SELECT "ms_column_types".* FROM "ms_column_types"
---
    <%= form.label :ms_column_types_id %>
    <%= form.select :ms_column_types_id, options_for_select(MsColumnType.all.map{|s|[s.options_for_select, s.id]}) %>