app/views/tables/_form.html.erb

    <%= form.label :table_types_id %>
    <%= form.select :table_types_id, options_for_select(TableType.all.map{|s|[s.option, s.id]}) %>
---
SELECT "table_types".* FROM "table_types"