app/views/ms_column_types/_form.html.erb

SELECT "rails_types".* FROM "rails_types"
---
    <%= form.label :rails_types_id %>
    <%= form.select :rails_types_id, options_for_select(RailsType.all.map{|s|[s.name, s.id]}) %>