app/controllers/columns_controller.rb

  def index
    @columns = Column.all
---
SELECT "columns".* FROM "columns"

  def edit
    @table = Table.find(@column.tables_id)
---
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @column = Column.new(column_params)
    @table = Table.find(@column.tables_id)
    puts '------------'
    puts @table
    respond_to do |format|
      if @column.save
---
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "columns" ("system_name", "database_name", "nn", "uq", "bin", "un", "zf", "g", "active_id", "active_created", "active_updated", "ms_column_types_id", "tables_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def update
    @table = Table.find(@column.tables_id)
    respond_to do |format|
      if @column.update(column_params)
---
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "columns" SET "uq" = $1, "ms_column_types_id" = $2, "updated_at" = $3 WHERE "columns"."id" = $4  [["uq", true], ["ms_column_types_id", 10], ["updated_at", "2018-11-29 19:30:02.937237"], ["id", 2]]

  def destroy
    @table = Table.find(@column.tables_id)
    @column.destroy
---
SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "columns" WHERE "columns"."id" = $1  [["id", 9]]

    def set_column
      @column = Column.find(params[:id])
---
SELECT  "columns".* FROM "columns" WHERE "columns"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]