app/controllers/ms_column_types_controller.rb

  def index
    @ms_column_types = MsColumnType.all
---
SELECT "ms_column_types".* FROM "ms_column_types"

  def create
    @ms_column_type = MsColumnType.new(ms_column_type_params)

    respond_to do |format|
      if @ms_column_type.save
---
INSERT INTO "ms_column_types" ("name", "description", "prefix", "created_at", "updated_at", "rails_types_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Nome"], ["description", ""], ["prefix", "NO_"], ["created_at", "2018-11-29 19:40:56.908438"], ["updated_at", "2018-11-29 19:40:56.908438"], ["rails_types_id", 1]]

  def update
    respond_to do |format|
      if @ms_column_type.update(ms_column_type_params)
---
UPDATE "ms_column_types" SET "rails_types_id" = $1, "updated_at" = $2 WHERE "ms_column_types"."id" = $3  [["rails_types_id", 5], ["updated_at", "2018-11-29 14:59:30.752324"], ["id", 10]]

    def set_ms_column_type
      @ms_column_type = MsColumnType.find(params[:id])
---
SELECT  "ms_column_types".* FROM "ms_column_types" WHERE "ms_column_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]