app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "PIUBS"], ["description", "Simple PIUBS application"], ["created_at", "2018-11-29 02:23:21.515084"], ["updated_at", "2018-11-29 02:23:21.515084"]]