app/controllers/rails_types_controller.rb

  def index
    @rails_types = RailsType.all
---
SELECT "rails_types".* FROM "rails_types"

  def create
    @rails_type = RailsType.new(rails_type_params)

    respond_to do |format|
      if @rails_type.save
---
INSERT INTO "rails_types" ("name", "active_size", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "binary"], ["active_size", false], ["created_at", "2018-11-29 14:35:57.322749"], ["updated_at", "2018-11-29 14:35:57.322749"]]

  def update
    respond_to do |format|
      if @rails_type.update(rails_type_params)
---
UPDATE "rails_types" SET "active_size" = $1, "updated_at" = $2 WHERE "rails_types"."id" = $3  [["active_size", true], ["updated_at", "2018-11-29 14:40:20.546283"], ["id", 10]]

    def set_rails_type
      @rails_type = RailsType.find(params[:id])
---
SELECT  "rails_types".* FROM "rails_types" WHERE "rails_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]