app/controllers/table_types_controller.rb

SELECT "table_types".* FROM "table_types"
---
  def index
    @table_types = TableType.all

INSERT INTO "table_types" ("name", "description", "created_at", "updated_at", "prefix") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @table_type = TableType.new(table_type_params)

    respond_to do |format|
      if @table_type.save

UPDATE "table_types" SET "prefix" = $1, "updated_at" = $2 WHERE "table_types"."id" = $3  [["prefix", "TB_"], ["updated_at", "2018-11-28 23:05:29.736049"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @table_type.update(table_type_params)

SELECT  "table_types".* FROM "table_types" WHERE "table_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_table_type
      @table_type = TableType.find(params[:id])