app/controllers/tables_controller.rb

SELECT "tables".* FROM "tables"
---
  def index
    @tables = Table.all

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def project
    @project = Project.find(@table.projects_id)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @project = Project.find(@table.projects_id)

INSERT INTO "tables" ("system_name", "database_name", "projects_id", "table_types_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["system_name", "State"], ["database_name", "ESTADO"], ["projects_id", 1], ["table_types_id", 1], ["created_at", "2018-11-29 15:29:51.820875"], ["updated_at", "2018-11-29 15:29:51.820875"]]
---
  def create
    @table = Table.new(table_params)

    respond_to do |format|
      if @table.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tables" WHERE "tables"."id" = $1  [["id", 11]]
---
  def destroy
    @project = Project.find(@table.projects_id)
    @table.destroy

SELECT  "tables".* FROM "tables" WHERE "tables"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_table
      @table = Table.find(params[:id])