app/models/ms_column_type.rb

SELECT  "rails_types".* FROM "rails_types" WHERE "rails_types"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def type_name
    tp_name = RailsType.find(self.rails_types_id).name