app/models/table.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def project_name
    Project.find(projects_id).title

SELECT  "table_types".* FROM "table_types" WHERE "table_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def type
    TableType.find(table_types_id)

SELECT "columns".* FROM "columns" WHERE "columns"."tables_id" = $1  [["tables_id", 1]]
---
  def generate_belongs_to(fk)
    "belongs_to :#{Table.find(fk.target_table).system_name.downcase}, foreign_key: '#{Column.find(fk.source_column).ms_database_name}', class_name: '#{Table.find(fk.target_table).ms_database_name}'"

SELECT "columns".* FROM "columns" WHERE "columns"."tables_id" = $1  [["tables_id", 1]]
---
  def generate_has_many(fk)
    "has_many :#{Table.find(fk.source_table).system_name.pluralize}, foreign_key: '#{Column.find(fk.source_column).ms_database_name}', class_name: '#{Table.find(fk.source_table).ms_database_name}'"